Бухгалтерские_задачи_Занятие_3/src/Documents/ПолучениеДенежныхСредств/ПолучениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолучениеДенежныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Наличные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДДС</name>
    <type>
      <types>CatalogRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_3/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_3/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_3/src/Documents/ПолучениеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Движение = Движения.Проводки.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Поступили денежные средства";
	
	Движение.СчетДт = ?(Наличные, ПланыСчетов.Счета.Касса, ПланыСчетов.Счета.СчетВБанке);
	
	Движение.СчетКт = КорСчет;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
